{
    "version": "https://jsonfeed.org/version/1",
    "title": "Let the quiet depths of wisdom unfold",
    "subtitle": "",
    "icon": "http://example.com/assets/favicon.ico",
    "description": "",
    "home_page_url": "http://example.com",
    "items": [
        {
            "id": "http://example.com/2024/10/24/Novel/it-was-a-dream/",
            "url": "http://example.com/2024/10/24/Novel/it-was-a-dream/",
            "title": "It was a Dream",
            "date_published": "2024-10-24T09:17:14.000Z",
            "content_html": "<h2 id=\"chapter-1-the-pig-farm-in-the-mist\"><a class=\"anchor\" href=\"#chapter-1-the-pig-farm-in-the-mist\">#</a> Chapter 1: The Pig Farm in the Mist</h2>\n<p>The air was heavy with mist, thick as a veil, saturating the sky and earth alike. The fog swirled around me, carrying the damp scent of earth and iron, as I found myself walking through my father’s pig farm. The farm seemed to stretch forever, enclosed by a massive iron fence that looped around the muddy ground. It was the sort of place I’d known all my life, but now, in this dream, it felt strange, unfamiliar. I wasn’t alone—beside me walked a woman I’d never met before, her face partially obscured by the fog. I couldn’t remember her name or how we’d come to walk together, but there was something calming about her presence.</p>\n<p>We wandered aimlessly, our steps slow and deliberate, as though neither of us wanted to disturb the quiet. Occasionally, a shadowy figure of a pig would materialize out of the mist, but then it would disappear just as quickly, lost to the shrouded world around us.</p>\n<p>The fence at the perimeter of the farm was tall, the bars thick with rust. Through the gaps, I could barely make out what lay beyond—the fog was too dense, making everything outside appear as a vague blur of whites and grays. It was as if the world outside the farm had ceased to exist.</p>\n<p>I stopped walking and turned to the woman. “What’s out there?” I asked, though I wasn’t sure if I meant the world outside or something more abstract—like what lay beyond this moment, this fog.</p>\n<p>She shrugged, her face expressionless. “Let’s go see,” she replied softly, her voice almost lost in the mist.</p>\n<p>We walked toward the far end of the farm, and as we did, the fog seemed to press closer, heavy and suffocating. The fence marked the border of this place, solid and imposing, but as we approached, I noticed a small hole at its base—just large enough for one of us to crawl through. It was strange how neither of us had noticed it before.</p>\n<p>“Should we go through?” I asked, already crouching down to examine it more closely. The hole looked like it had been made recently, almost as if someone wanted us to find it.</p>\n<p>“Why not?” she said, a small smile tugging at the corners of her lips. Her face was clearer now, though still shadowed by the mist.</p>\n<p>We both knelt down, squeezing through the narrow gap, one after the other. The metal was cold and rough against my skin, but the moment we passed through, the air on the other side felt different—lighter, freer. There was no turning back now.</p>\n<hr />\n<h2 id=\"chapter-2-the-infinite-white-wilderness\"><a class=\"anchor\" href=\"#chapter-2-the-infinite-white-wilderness\">#</a> Chapter 2: The Infinite White Wilderness</h2>\n<p>As soon as we emerged on the other side of the fence, the fog seemed to lift slightly, revealing an expanse of barren land stretching in every direction. The ground beneath our feet was hard-packed dirt, its surface broken only by cracks and the occasional tuft of dry grass. It felt as though we had crossed into another world—one that was both familiar and foreign.</p>\n<p>The woman and I continued to walk, moving further and further away from the pig farm, its form quickly disappearing into the fog behind us. The sky above was a dull, oppressive gray, the kind of color that made it impossible to tell what time of day it was. Despite the lack of landmarks, we kept walking. There was no conversation between us, only the steady rhythm of our footsteps and the occasional soft crunch of dirt beneath our shoes.</p>\n<p>Every now and then, I thought I saw shapes in the mist—strange, indistinct figures that flickered in and out of view. At first, I dismissed them as tricks of the light, but the further we walked, the more frequent these shapes became. Sometimes they looked like animals—other times, they seemed human. Yet whenever I tried to get a closer look, they would fade away, swallowed by the whiteness around us.</p>\n<p>The silence between us grew heavier, though it wasn’t uncomfortable. It felt as if the world itself was waiting—waiting for something to happen, for something to change. But as we walked, nothing did. The land stretched on endlessly, and I began to wonder if we were moving at all, or if the world was simply rearranging itself around us, trapping us in a loop.</p>\n<p>The mist thinned further as the hours wore on, and just when I thought the emptiness would continue forever, I saw a faint glow on the horizon. It flickered like a distant candle, soft and inviting, though it seemed impossibly far away.</p>\n<p>“Do you see that?” I asked, pointing to the faint light.</p>\n<p>The woman nodded, her eyes fixed on the distant glow. “A city,” she murmured. “Maybe we can find something there.”</p>\n<p>With renewed purpose, we began to move faster, our steps quickening as we made our way toward the light. But as we walked, the day began to fade, and the fog finally dissipated, replaced by the coolness of evening. The city, now more visible, was shrouded in shadows, its buildings towering but somehow indistinct.</p>\n<hr />\n<h2 id=\"chapter-3-the-city-in-shadows\"><a class=\"anchor\" href=\"#chapter-3-the-city-in-shadows\">#</a> Chapter 3: The City in Shadows</h2>\n<p>By the time we reached the city, the sun had long since set, and the only light came from the dim, flickering streetlamps that lined the empty roads. The buildings were old, their facades cracked and worn, with many windows darkened as though the inhabitants had long since abandoned them. There was an eerie stillness to the place, the kind of quiet that made me feel as though we were the only ones left in the world.</p>\n<p>We walked through the narrow streets, the yellowish glow of the lamps casting long shadows that stretched out behind us. Occasionally, I caught glimpses of movement in the corner of my eye—a curtain shifting in a window, the faint creak of a door closing—but when I turned to look, there was nothing there. The city felt alive, but it was an unsettling kind of life, as if the place itself was watching us.</p>\n<p>“This place…” I trailed off, unsure of how to describe the sensation.</p>\n<p>“It’s waiting,” the woman said, her voice barely above a whisper. “For us.”</p>\n<p>We continued walking, the sound of our footsteps echoing down the narrow, crooked streets. In the distance, I could see the faint neon glow of a tall building—a skyscraper, its lights blinking in the darkness. It seemed out of place amidst the decaying cityscape, almost too bright, too modern compared to the rest of the surroundings.</p>\n<p>“I think that’s where we need to go,” I said, pointing toward the distant building. “It looks like a mall or something.”</p>\n<p>“Let’s head there, then,” she replied, though her voice lacked the certainty it once had.</p>\n<p>But no matter how long we walked, the building never seemed to get any closer. It loomed in the distance like a mirage, teasing us with its brightness but always staying just beyond our reach. The city streets twisted and turned in nonsensical ways, doubling back on themselves, leading us in circles. I began to feel as though the city was deliberately keeping us from reaching our destination, like it didn’t want us to leave.</p>\n<p>Frustration gnawed at me, but I didn’t voice it. Instead, I glanced at the woman, her face unreadable in the dim light. She hadn’t said anything for a while now, her focus entirely on the road ahead.</p>\n<p>After what felt like hours of walking, I slowed my pace, my legs growing heavy with fatigue. “Maybe we should stop for the night,” I suggested. “We can find a place to stay and try again tomorrow.”</p>\n<p>She nodded in agreement, and we began to search for somewhere to rest.</p>\n<hr />\n<h2 id=\"chapter-4-the-flickering-world\"><a class=\"anchor\" href=\"#chapter-4-the-flickering-world\">#</a> Chapter 4: The Flickering World</h2>\n<p>The motel we found was small and tucked away on a side street, barely visible between the shadows of taller buildings. It looked old, but it was clean enough, and I was too tired to care about the details. We stepped inside, and the receptionist handed us a key with a faint smile, her eyes dull and indifferent. She didn’t ask us any questions, and we didn’t offer any explanations.</p>\n<p>The room itself was modest—a single large bed, a wooden desk with a chair, and an old computer sitting on top of it. There was a window, but the curtains were drawn, and I had no desire to look outside. The room felt safe, in a way that was both comforting and unsettling.</p>\n<p>I dropped my bag onto the bed and walked over to the computer. Something about it drew me in, its old, boxy frame sparking a sense of nostalgia deep within me. I turned it on, and to my surprise, it booted up quickly, its screen flickering to life with an old game I hadn’t played since childhood.</p>\n<p>The game’s world was strange, made up of floating platforms suspended in a void of endless black. It was a game my brother and I used to play, though I couldn’t remember all the details. As I clicked through the menus and began to explore the digital landscape, I felt a strange mixture of joy and sadness—joy for the memories it stirred, and sadness for the time that had passed.</p>\n<p>But as I played, the game felt wrong. The platforms were too fragile, the world too small. It was as if I were trapped in a box, with no way to escape. The thin walls of the game world were suffocating, and the more I played, the more I felt the weight of those walls pressing in on me.</p>\n<p>I stopped playing and turned off the computer, sitting back in the chair with a heavy sigh. The woman was lying on the bed, watching me with a faint smile.</p>\n<p>“You miss it, don’t you?” she asked.</p>\n<p>“Miss what?” I replied, though I knew exactly what she</p>\n<p>meant.</p>\n<p>“The way things used to be,” she said softly. “Before everything changed.”</p>\n<p>I didn’t answer. Instead, I picked up my phone and glanced at the time. It was late—past eleven. I should’ve called my parents, told them where I was, but something stopped me. I typed out a message to my mother, my fingers hovering over the screen, but then, just as quickly, I deleted it.</p>\n<p>“I’ll deal with it tomorrow,” I muttered, more to myself than to her.</p>\n<p>The woman didn’t respond, and I climbed into bed beside her, pulling the blankets up around me. My thoughts were jumbled, filled with fragments of the day and memories I hadn’t touched in years. I wanted to keep walking, to see where the road would lead, but there was also the weight of responsibility—the looming exam, the real world I had left behind.</p>\n<p>“I have a test tomorrow,” I said, my voice barely a whisper.</p>\n<p>“I’ll take you there,” she replied, her voice calm and soothing. “In the morning.”</p>\n<p>And with that, I closed my eyes, letting the world fade away.</p>\n<hr />\n<h2 id=\"chapter-5-the-message-undone\"><a class=\"anchor\" href=\"#chapter-5-the-message-undone\">#</a> Chapter 5: The Message Undone</h2>\n<p>When I woke, the room was bathed in soft morning light, the heavy shadows of the night replaced by a quiet stillness. The woman was already up, standing by the window with her back to me. She looked out into the city, though I couldn’t tell what she was seeing.</p>\n<p>I rubbed my eyes, feeling groggy and disoriented. For a moment, I had forgotten where I was, but the memories of the previous night slowly came flooding back. The fog, the endless walk, the strange, shifting city—it all felt like a distant dream, though I knew it had been real.</p>\n<p>The clock on the wall ticked quietly, and I glanced at my phone. It was already past six. My exam was in an hour.</p>\n<p>“I need to go,” I said, sitting up and swinging my legs over the side of the bed.</p>\n<p>The woman turned to face me, her expression unreadable. “I’ll take you,” she said again, her voice steady. “We’ll make it in time.”</p>\n<p>I nodded, though a part of me wondered if I really wanted to go. There was something about this world, this dreamlike city, that made me hesitate. It felt like I had stumbled into a place where time didn’t matter, where the rules of reality didn’t apply. And yet, the pull of the real world was strong—my responsibilities, my obligations—they weighed on me, pulling me back toward the familiar.</p>\n<p>We left the motel and stepped out into the street. The city had changed again—its buildings more solid, its streets more defined. The fog was gone, replaced by a clear, pale sky. It felt like the dream was fading, like the world was becoming more real.</p>\n<p>We walked in silence, the air cool and crisp. As we approached the edge of the city, I felt a strange sense of finality, as if this journey was coming to an end.</p>\n<p>The woman stopped suddenly, turning to face me. “Do you want to go back?” she asked, her voice soft but piercing.</p>\n<p>I hesitated, the weight of her question sinking into me. Did I want to return to the real world? Or did I want to stay in this strange, shifting place, where nothing was certain and anything was possible?</p>\n<p>I looked at her, and for the first time, I realized that I didn’t know what lay behind her calm exterior. She had been my guide, my companion, but now I wondered if she was something more—something deeper, more mysterious. Was she a part of this world, or had she come from somewhere else?</p>\n<p>“I don’t know,” I whispered.</p>\n<p>She smiled, but it was a sad smile, as if she already knew the answer. “You’ll find your way,” she said, stepping aside to let me pass.</p>\n<p>I took a deep breath and walked forward, leaving her behind. The city faded from view, and soon, the real world came rushing back.</p>\n<hr />\n<h2 id=\"chapter-6-awakening\"><a class=\"anchor\" href=\"#chapter-6-awakening\">#</a> Chapter 6: Awakening</h2>\n<p>I woke up to the sound of my alarm buzzing next to my bed. The morning sun streamed through the window, casting long shadows across the room. For a moment, I lay there, staring at the ceiling, my mind still tangled in the remnants of the dream.</p>\n<p>The test was today. I had to get up, get ready, go back to my routine. But something inside me had changed. The dream had left a mark, something subtle but undeniable.</p>\n<p>I got out of bed and looked out the window. The world outside was bright and clear, but in the back of my mind, I could still see the fog, the endless city streets, the flickering lights in the distance.</p>\n<p>And the woman—I could still feel her presence, lingering like a shadow, just out of reach.</p>\n<p>As I dressed and prepared to leave, I couldn’t help but wonder: had it all been a dream? Or had I truly glimpsed something beyond the ordinary, something that would stay with me, no matter where I went?</p>\n<p>With a final glance in the mirror, I grabbed my bag and headed out the door, ready to face the day. But as I walked, I knew that the journey was far from over. The fog might have lifted, but the questions remained.</p>\n<p>And somewhere, deep within me, I knew I would return to that world again—someday.</p>\n",
            "tags": [
                "Novel",
                "life"
            ]
        },
        {
            "id": "http://example.com/2024/10/24/Research/fitts-law-on-gaze-selection/",
            "url": "http://example.com/2024/10/24/Research/fitts-law-on-gaze-selection/",
            "title": "Fitts' Law on Gaze Selection",
            "date_published": "2024-10-24T09:17:14.000Z",
            "content_html": "<h2 id=\"what-is-fitts-law\"><a class=\"anchor\" href=\"#what-is-fitts-law\">#</a> What is Fitts' Law?</h2>\n<p>Fitts' Law was proposed by Paul Fitts, who is a psychologist and a pioneer in human factors. Back to the 20th century, researcher had some overview in how human performance, but there was still some questions was not solved:</p>\n<ul>\n<li>How long dose it take to make a movement to a known target?</li>\n<li>How does this depend on properties of the movement task (distance and size of the target)?</li>\n</ul>\n<p>The best way to solve these questions is to build a model for it. But how? Because these questions are human behavior questions, Paul need some data from experiments to build the model. And the way he do this, is also how modern HCI researcher usually to solve a HCI problem.</p>\n<h3 id=\"fitts-experiment\"><a class=\"anchor\" href=\"#fitts-experiment\">#</a> Fitts' Experiment</h3>\n<p><img loading=\"lazy\" data-src=\"/assets/imgs/20241025-1.png\" alt=\"\" /><br />\nPaul designed a experiment as the picture above present. This 1D task is to click a button with certain width in certain distance:</p>\n<ul>\n<li>Four distances (<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">D</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span>): 2, 4, 8, 16 inch</li>\n<li>Four widths (<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>W</mi></mrow><annotation encoding=\"application/x-tex\">W</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span></span></span></span>): 0.25, 0.5, 1, 2 inch</li>\n<li>16 combination</li>\n</ul>\n<p><img loading=\"lazy\" data-src=\"/assets/imgs/20241025-2.png\" alt=\"\" /></p>\n<p>Participants were asked to move their pen to touch the button in the distance, and the movement time were recorded as the figure shows below:</p>\n<p><img loading=\"lazy\" data-src=\"/assets/imgs/20241025-3.png\" alt=\"\" /><br />\n<img loading=\"lazy\" data-src=\"/assets/imgs/20241025-4.png\" alt=\"\" /></p>\n<p>Obviously and intuitionally, the movement time increase as the distance increase, and the movement time decrease as the button size increase. But this is not the all. If we look more carefully, there is some data that really close each other:</p>\n<p><img loading=\"lazy\" data-src=\"/assets/imgs/20241025-5.png\" alt=\"\" /></p>\n<p>The figure above shows that the movement time at <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">(</mo><mi>D</mi><mo>:</mo><mn>2</mn><mo separator=\"true\">,</mo><mi>W</mi><mo>:</mo><mn>0.25</mn><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">(D:2, W:0.25)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8778em;vertical-align:-0.1944em;\"></span><span class=\"mord\">2</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\">0.25</span><span class=\"mclose\">)</span></span></span></span> is close to the movement time at <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">(</mo><mi>D</mi><mo>:</mo><mn>4</mn><mo separator=\"true\">,</mo><mi>W</mi><mo>:</mo><mn>0.5</mn><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">(D:4, W:0.5)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8778em;vertical-align:-0.1944em;\"></span><span class=\"mord\">4</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\">0.5</span><span class=\"mclose\">)</span></span></span></span>, and also <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">(</mo><mi>D</mi><mo>:</mo><mn>8</mn><mo separator=\"true\">,</mo><mi>W</mi><mo>:</mo><mn>1</mn><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">(D:8, W:1)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8778em;vertical-align:-0.1944em;\"></span><span class=\"mord\">8</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\">1</span><span class=\"mclose\">)</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">(</mo><mi>D</mi><mo>:</mo><mn>16</mn><mo separator=\"true\">,</mo><mi>W</mi><mo>:</mo><mn>2</mn><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">(D:16, W:2)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8778em;vertical-align:-0.1944em;\"></span><span class=\"mord\">16</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\">2</span><span class=\"mclose\">)</span></span></span></span>. This is not the coincident. We can also easily see that the movement time at <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">(</mo><mi>D</mi><mo>:</mo><mn>8</mn><mo separator=\"true\">,</mo><mi>W</mi><mo>:</mo><mn>0.25</mn><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">(D:8, W:0.25)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8778em;vertical-align:-0.1944em;\"></span><span class=\"mord\">8</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\">0.25</span><span class=\"mclose\">)</span></span></span></span> is similar to the movement time at <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mo stretchy=\"false\">(</mo><mi>D</mi><mo>:</mo><mn>16</mn><mo separator=\"true\">,</mo><mi>W</mi><mo>:</mo><mn>0.5</mn><mo stretchy=\"false\">)</mo></mrow><annotation encoding=\"application/x-tex\">(D:16, W:0.5)</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mopen\">(</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.8778em;vertical-align:-0.1944em;\"></span><span class=\"mord\">16</span><span class=\"mpunct\">,</span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">:</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\">0.5</span><span class=\"mclose\">)</span></span></span></span> and so on. Hence, we can have something in conclude.</p>\n<h4 id=\"fitts-experiment-conclusions\"><a class=\"anchor\" href=\"#fitts-experiment-conclusions\">#</a> Fitts' Experiment Conclusions</h4>\n<p>Firstly, the movement time depends on the task. Different tasks have different movement time.</p>\n<p>Also, the pointing task has two properties that affect performance:</p>\n<ul>\n<li>Target distance (=Amplitude of the movement)</li>\n<li>Target width (=Tolerance for landing on the target)</li>\n</ul>\n<p>When a target is nearer, we can reach it faster;<br />\nWhen a target is smaller, we have to slow down to land on it.</p>\n<h3 id=\"index-of-difficulty-id\"><a class=\"anchor\" href=\"#index-of-difficulty-id\">#</a> Index of Difficulty (<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>I</mi><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">ID</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">I</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span>)</h3>\n<p>To model the result, Paul Fitts proposed to combine distance and width in to a single <em>index of difficulty</em>, measured in bits:</p>\n<p><span class=\"katex-display\"><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"block\"><semantics><mrow><mi>I</mi><mi>D</mi><mo>=</mo><msub><mrow><mi>log</mi><mo>⁡</mo></mrow><mn>2</mn></msub><mrow><mo fence=\"true\">(</mo><mfrac><mi>D</mi><mi>W</mi></mfrac><mo>+</mo><mn>1</mn><mo fence=\"true\">)</mo></mrow></mrow><annotation encoding=\"application/x-tex\">ID = \\log_2 \\left( \\frac{D}{W} + 1 \\right)\n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">I</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:2.4em;vertical-align:-0.95em;\"></span><span class=\"mop\"><span class=\"mop\">lo<span style=\"margin-right:0.01389em;\">g</span></span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.207em;\"><span style=\"top:-2.4559em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.2441em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"minner\"><span class=\"mopen delimcenter\" style=\"top:0em;\"><span class=\"delimsizing size3\">(</span></span><span class=\"mord\"><span class=\"mopen nulldelimiter\"></span><span class=\"mfrac\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:1.3603em;\"><span style=\"top:-2.314em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span></span></span><span style=\"top:-3.23em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"frac-line\" style=\"border-bottom-width:0.04em;\"></span></span><span style=\"top:-3.677em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.686em;\"><span></span></span></span></span></span><span class=\"mclose nulldelimiter\"></span></span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mord\">1</span><span class=\"mclose delimcenter\" style=\"top:0em;\"><span class=\"delimsizing size3\">)</span></span></span></span></span></span></span></p>\n<p>This formula shows the basic relation between <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">D</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>W</mi></mrow><annotation encoding=\"application/x-tex\">W</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span></span></span></span>. Generally speaking, at the same difficulty level, The <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mfrac><mi>D</mi><mi>W</mi></mfrac></mrow><annotation encoding=\"application/x-tex\">\\frac{D}{W}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1.2173em;vertical-align:-0.345em;\"></span><span class=\"mord\"><span class=\"mopen nulldelimiter\"></span><span class=\"mfrac\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8723em;\"><span style=\"top:-2.655em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.13889em;\">W</span></span></span></span><span style=\"top:-3.23em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"frac-line\" style=\"border-bottom-width:0.04em;\"></span></span><span style=\"top:-3.394em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.02778em;\">D</span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.345em;\"><span></span></span></span></span></span><span class=\"mclose nulldelimiter\"></span></span></span></span></span> should be remain the same.</p>\n<p>For example, these for tasks have the same <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mfrac><mi>D</mi><mi>W</mi></mfrac></mrow><annotation encoding=\"application/x-tex\">\\frac{D}{W}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:1.2173em;vertical-align:-0.345em;\"></span><span class=\"mord\"><span class=\"mopen nulldelimiter\"></span><span class=\"mfrac\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.8723em;\"><span style=\"top:-2.655em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.13889em;\">W</span></span></span></span><span style=\"top:-3.23em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"frac-line\" style=\"border-bottom-width:0.04em;\"></span></span><span style=\"top:-3.394em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\"><span class=\"mord mathnormal mtight\" style=\"margin-right:0.02778em;\">D</span></span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.345em;\"><span></span></span></span></span></span><span class=\"mclose nulldelimiter\"></span></span></span></span></span> ratio 8.</p>\n<p><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>I</mi><mi>D</mi><mo>=</mo><msub><mrow><mi>log</mi><mo>⁡</mo></mrow><mn>2</mn></msub><mo stretchy=\"false\">(</mo><mn>8</mn><mo>+</mo><mn>1</mn><mo stretchy=\"false\">)</mo><mo>=</mo><mn>3.17</mn><mtext> bits</mtext></mrow><annotation encoding=\"application/x-tex\">ID = \\log_2 (8 + 1) = 3.17 \\text{ bits}</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">I</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mop\"><span class=\"mop\">lo<span style=\"margin-right:0.01389em;\">g</span></span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.207em;\"><span style=\"top:-2.4559em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.2441em;\"><span></span></span></span></span></span></span><span class=\"mopen\">(</span><span class=\"mord\">8</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:1em;vertical-align:-0.25em;\"></span><span class=\"mord\">1</span><span class=\"mclose\">)</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord\">3.17</span><span class=\"mord text\"><span class=\"mord\"> bits</span></span></span></span></span><br />\n<img loading=\"lazy\" data-src=\"/assets/imgs/20241025-5.png\" alt=\"\" /></p>\n<p>The figure below visualized the pointer and the object. In the same distance, the larger target leads to a smaller <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>I</mi><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">ID</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">I</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span>; In the same size, nearer target leads to a smaller <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>I</mi><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">ID</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">I</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span>.</p>\n<p><img loading=\"lazy\" data-src=\"/assets/imgs/20241025-8.png\" alt=\"\" /></p>\n<h3 id=\"building-a-fitts-law-model\"><a class=\"anchor\" href=\"#building-a-fitts-law-model\">#</a> Building a Fitts' Law Model</h3>\n<p><img loading=\"lazy\" data-src=\"/assets/imgs/20241025-9.png\" alt=\"\" /><br />\nMovement time depends on task difficulty, and the relationship is linear. Fitts' Law: <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>M</mi><mi>T</mi><mo>=</mo><mi>a</mi><mo>+</mo><mi>b</mi><mo>∗</mo><mi>I</mi><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">MT = a + b * ID</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">MT</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6667em;vertical-align:-0.0833em;\"></span><span class=\"mord mathnormal\">a</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">b</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">∗</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">I</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span>, where the values for <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>a</mi></mrow><annotation encoding=\"application/x-tex\">a</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">a</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>b</mi></mrow><annotation encoding=\"application/x-tex\">b</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">b</span></span></span></span> are specific to the apparatus / device.</p>\n<p><span class=\"katex-display\"><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"block\"><semantics><mrow><mi>M</mi><mi>T</mi><mo>=</mo><mi>a</mi><mo>+</mo><mi>b</mi><mo>⋅</mo><mi>I</mi><mi>D</mi><mo>=</mo><mi>a</mi><mo>+</mo><mi>b</mi><mo>⋅</mo><msub><mrow><mi>log</mi><mo>⁡</mo></mrow><mn>2</mn></msub><mrow><mo fence=\"true\">(</mo><mfrac><mi>D</mi><mi>W</mi></mfrac><mo>+</mo><mn>1</mn><mo fence=\"true\">)</mo></mrow></mrow><annotation encoding=\"application/x-tex\">MT = a + b \\cdot ID = a + b \\cdot \\log_2 \\left( \\frac{D}{W} + 1 \\right)\n</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">MT</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6667em;vertical-align:-0.0833em;\"></span><span class=\"mord mathnormal\">a</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">b</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">⋅</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">I</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span><span class=\"mrel\">=</span><span class=\"mspace\" style=\"margin-right:0.2778em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6667em;vertical-align:-0.0833em;\"></span><span class=\"mord mathnormal\">a</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">b</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">⋅</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span></span><span class=\"base\"><span class=\"strut\" style=\"height:2.4em;vertical-align:-0.95em;\"></span><span class=\"mop\"><span class=\"mop\">lo<span style=\"margin-right:0.01389em;\">g</span></span><span class=\"msupsub\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.207em;\"><span style=\"top:-2.4559em;margin-right:0.05em;\"><span class=\"pstrut\" style=\"height:2.7em;\"></span><span class=\"sizing reset-size6 size3 mtight\"><span class=\"mord mtight\">2</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.2441em;\"><span></span></span></span></span></span></span><span class=\"mspace\" style=\"margin-right:0.1667em;\"></span><span class=\"minner\"><span class=\"mopen delimcenter\" style=\"top:0em;\"><span class=\"delimsizing size3\">(</span></span><span class=\"mord\"><span class=\"mopen nulldelimiter\"></span><span class=\"mfrac\"><span class=\"vlist-t vlist-t2\"><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:1.3603em;\"><span style=\"top:-2.314em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span></span></span><span style=\"top:-3.23em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"frac-line\" style=\"border-bottom-width:0.04em;\"></span></span><span style=\"top:-3.677em;\"><span class=\"pstrut\" style=\"height:3em;\"></span><span class=\"mord\"><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span><span class=\"vlist-s\">​</span></span><span class=\"vlist-r\"><span class=\"vlist\" style=\"height:0.686em;\"><span></span></span></span></span></span><span class=\"mclose nulldelimiter\"></span></span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mbin\">+</span><span class=\"mspace\" style=\"margin-right:0.2222em;\"></span><span class=\"mord\">1</span><span class=\"mclose delimcenter\" style=\"top:0em;\"><span class=\"delimsizing size3\">)</span></span></span></span></span></span></span></p>\n<ul>\n<li>Distance (<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">D</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span>): distance of the target</li>\n<li>Width (<span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>W</mi></mrow><annotation encoding=\"application/x-tex\">W</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span></span></span></span>): width of the target in the direction of the movement</li>\n<li><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>I</mi><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">ID</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">I</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span>: Index of difficulty of the task, in <em>bits</em></li>\n<li><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>b</mi></mrow><annotation encoding=\"application/x-tex\">b</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">b</span></span></span></span>: rate at which time increases with task difficulty, in <em>seconds/bit</em></li>\n<li><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>a</mi></mrow><annotation encoding=\"application/x-tex\">a</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">a</span></span></span></span> is a time constant, in <em>seconds</em></li>\n</ul>\n<div class=\"note info\">\n<ul>\n<li><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">D</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span>, <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>W</mi></mrow><annotation encoding=\"application/x-tex\">W</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.13889em;\">W</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>I</mi><mi>D</mi></mrow><annotation encoding=\"application/x-tex\">ID</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6833em;\"></span><span class=\"mord mathnormal\" style=\"margin-right:0.07847em;\">I</span><span class=\"mord mathnormal\" style=\"margin-right:0.02778em;\">D</span></span></span></span> are properties of the movement task\n<ul>\n<li><ins>independent</ins> of the device used for the movement</li>\n</ul>\n</li>\n<li><span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>a</mi></mrow><annotation encoding=\"application/x-tex\">a</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.4306em;\"></span><span class=\"mord mathnormal\">a</span></span></span></span> and <span class=\"katex\"><span class=\"katex-mathml\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><semantics><mrow><mi>b</mi></mrow><annotation encoding=\"application/x-tex\">b</annotation></semantics></math></span><span class=\"katex-html\" aria-hidden=\"true\"><span class=\"base\"><span class=\"strut\" style=\"height:0.6944em;\"></span><span class=\"mord mathnormal\">b</span></span></span></span> are <ins>device-dependent</ins>, on the device and body part used to perform the movement</li>\n</ul>\n</div>\n<h3 id=\"speed-accuracy-trade-off\"><a class=\"anchor\" href=\"#speed-accuracy-trade-off\">#</a> Speed-Accuracy Trade-off</h3>\n<h3 id=\"throughput-in-hci\"><a class=\"anchor\" href=\"#throughput-in-hci\">#</a> Throughput in HCI</h3>\n<h2 id=\"why-fitts-law-is-important\"><a class=\"anchor\" href=\"#why-fitts-law-is-important\">#</a> Why Fitts' Law is Important?</h2>\n",
            "tags": [
                "Research",
                "Science",
                "HCI"
            ]
        },
        {
            "id": "http://example.com/2024/10/23/hello-world/",
            "url": "http://example.com/2024/10/23/hello-world/",
            "title": "Hello World",
            "date_published": "2024-10-23T19:17:31.000Z",
            "content_html": "<p>Welcome to <a href=\"https://hexo.io/\">Hexo</a>! This is your very first post. Check <a href=\"https://hexo.io/docs/\">documentation</a> for more info. If you get any problems when using Hexo, you can find the answer in <a href=\"https://hexo.io/docs/troubleshooting.html\">troubleshooting</a> or you can ask me on <a href=\"https://github.com/hexojs/hexo/issues\">GitHub</a>.</p>\n<h2 id=\"quick-start\"><a class=\"anchor\" href=\"#quick-start\">#</a> Quick Start</h2>\n<h3 id=\"create-a-new-post\"><a class=\"anchor\" href=\"#create-a-new-post\">#</a> Create a new post</h3>\n<figure class=\"highlight bash\"><figcaption data-lang=\"bash\"></figcaption><table><tr><td data-num=\"1\"></td><td><pre>$ hexo new <span class=\"token string\">\"My New Post\"</span></pre></td></tr></table></figure><p>More info: <a href=\"https://hexo.io/docs/writing.html\">Writing</a></p>\n<h3 id=\"run-server\"><a class=\"anchor\" href=\"#run-server\">#</a> Run server</h3>\n<figure class=\"highlight bash\"><figcaption data-lang=\"bash\"></figcaption><table><tr><td data-num=\"1\"></td><td><pre>$ hexo server</pre></td></tr></table></figure><p>More info: <a href=\"https://hexo.io/docs/server.html\">Server</a></p>\n<h3 id=\"generate-static-files\"><a class=\"anchor\" href=\"#generate-static-files\">#</a> Generate static files</h3>\n<figure class=\"highlight bash\"><figcaption data-lang=\"bash\"></figcaption><table><tr><td data-num=\"1\"></td><td><pre>$ hexo generate</pre></td></tr></table></figure><p>More info: <a href=\"https://hexo.io/docs/generating.html\">Generating</a></p>\n<h3 id=\"deploy-to-remote-sites\"><a class=\"anchor\" href=\"#deploy-to-remote-sites\">#</a> Deploy to remote sites</h3>\n<figure class=\"highlight bash\"><figcaption data-lang=\"bash\"></figcaption><table><tr><td data-num=\"1\"></td><td><pre>$ hexo deploy</pre></td></tr></table></figure><p>More info: <a href=\"https://hexo.io/docs/one-command-deployment.html\">Deployment</a></p>\n",
            "tags": []
        },
        {
            "id": "http://example.com/2024/10/23/Novel/reflections-in-the-mirror/",
            "url": "http://example.com/2024/10/23/Novel/reflections-in-the-mirror/",
            "title": "Reflections in the Mirror",
            "date_published": "2024-10-23T19:17:31.000Z",
            "content_html": "<h3 id=\"chapter-1-the-morning-of-the-change\"><a class=\"anchor\" href=\"#chapter-1-the-morning-of-the-change\">#</a> Chapter 1: <strong>The Morning of the Change</strong></h3>\n<p>When I opened my eyes, everything felt different, though at first, I couldn’t pinpoint exactly what it was. The sun was streaming through the window in the usual way, casting that familiar glow over my bedroom. The posters on my wall, my basketball shoes tucked neatly under my desk, even the faint sound of my little sister humming in the room next door—it was all the same. But as I lay there, still wrapped in the quiet peace of morning, something felt <em>off</em>.</p>\n<p>I brushed it off at first, thinking maybe it was just one of those mornings where the world feels slightly disjointed for no real reason. I swung my legs over the side of the bed, my feet touching the cool floor, and that’s when I felt it. Something was...different. My body. My chest. My legs. I froze for a moment, not daring to look down.</p>\n<p>In an instant, panic washed over me.</p>\n<p>My hands flew to my chest. It wasn’t flat anymore. My heartbeat roared in my ears as my fingers trembled over the unfamiliar softness beneath my shirt. I stood up suddenly, rushing to the mirror across the room. And there I was—staring back at a girl I didn’t recognize.</p>\n<p>I reached up and touched my face, half-expecting the reflection to somehow shatter and reveal something else beneath. But no. It was me. My hair, longer than it had been the night before. My face, softer, more delicate. My shoulders narrower. Everything about me had changed overnight, and yet...it was still <em>me</em>.</p>\n<p>I stumbled back, nearly tripping over my own feet, and sat down hard on the edge of my bed. My mind was spinning, trying to piece together how this could’ve happened. Was it a dream? Some strange, vivid nightmare that I would wake from at any second? But the longer I sat there, the more I realized it wasn’t. This was real.</p>\n<p>I stood up again, my legs feeling shaky, and took another long look at myself in the mirror. My eyes were still the same shade of brown, the same ones that had stared out at the world from my reflection every morning. But everything else... I looked like a stranger, yet deep inside, I still <em>felt</em> like me.</p>\n<p>I had been a boy yesterday. I had gone to bed as a boy. So why now...? My mind raced, searching for any logical explanation, but nothing made sense. I was only twelve, just a kid. Things like this didn’t happen. People didn’t just <em>change</em> overnight.</p>\n<p>I reached for my phone on the desk and hesitated. Who would I even tell? My parents? My sister? They were probably downstairs already, making breakfast. Would they even believe me? What if they already knew? What if this was something everyone else knew but hadn’t told me?</p>\n<p>I tiptoed down the hall to the bathroom, hoping to avoid anyone for now. I needed time to process this. I needed to figure out how to handle it. Locking the door behind me, I stared at myself again in the bathroom mirror, more closely this time. My hair had grown overnight—wasn’t that impossible? And my face, though still recognizable, had softened. I pulled my shirt up slightly, staring at the new curves on my body. I felt dizzy. How was this even possible?</p>\n<p>There was no denying it. I was a girl.</p>\n<p>I stood there, breathing deeply, trying to calm the chaos swirling in my head. What did this mean? Was it permanent? Was I going to wake up tomorrow and be back to normal? Or was this my new reality, for good? I had no answers, and that terrified me.</p>\n<p>Suddenly, there was a knock at the door.</p>\n<p>“Yūto, are you in there? Breakfast is ready!” My mother’s voice sounded as cheery as ever from the other side.</p>\n<p>My heart stopped. How could I face her like this? She would freak out. She would—</p>\n<p>Wait. She had called me Yūto. My name. My <em>boy</em> name. Did she not notice anything wrong? I hesitated, still staring at myself in the mirror. What if...what if no one noticed the change? What if, to them, I still looked like the same person?</p>\n<p>I cautiously opened the door. My mother stood there, smiling warmly. “You’re going to be late for school if you don’t hurry.”</p>\n<p>She didn’t react. Her smile didn’t falter. Her eyes didn’t widen in surprise. She just looked at me like everything was completely normal.</p>\n<p>“Uh, okay,” I mumbled, stepping past her, feeling numb.</p>\n<p>As I walked to the kitchen, I realized something even stranger. My body <em>felt</em> different, but my surroundings—the people in my life, my family—were acting as if nothing had changed at all. It was as if the world had shifted in the most dramatic way possible for me, yet to everyone else, it was just another ordinary day.</p>\n<p>I sat down at the table, picking at my breakfast. My little sister, Hina, was chattering away about something, but I couldn’t focus. My mind was still spinning. Should I say something? Should I ask them if they noticed? But every time I opened my mouth, the words just wouldn’t come out. What could I even say?</p>\n<p>“Yūto, are you feeling okay?” my dad asked from across the table, looking at me with concern.</p>\n<p>I nodded quickly. “Yeah. I’m fine.”</p>\n<p>He didn’t press further, but I could tell he was watching me. I finished breakfast in silence and went back to my room to get dressed for school. When I pulled on my uniform, it didn’t fit quite the same. My shirt felt tighter across the chest, my pants were a little looser around the waist. I tried to ignore it. I had to focus on getting through the day. Whatever was happening, I would deal with it later.</p>\n<p>When I arrived at school, everything felt eerily normal. I walked through the gates, expecting at least one person to stare at me, to notice that I was completely different. But no one did. It was like they all saw the same old Yūto they had always known.</p>\n<p>But I knew the truth. I was different now.</p>\n<p>I avoided my friends that day, especially the basketball court. The thought of playing basketball—the thing I had loved most—felt wrong now. I wasn’t sure why, but something inside me resisted. It was as if my old self, the boy who had loved to dribble, to shoot, to dunk, had been left behind, replaced by someone else entirely.</p>\n<p>As I wandered the halls, lost in my thoughts, I felt an unfamiliar sense of isolation. My best friend, Ren, wasn’t here anymore. He had left for America just a few weeks before. I thought about how much easier it would’ve been to talk to him, to tell him everything. Ren would’ve known what to say. He always did.</p>\n<p>But now, Ren was gone. And I was...someone else.</p>\n<hr />\n<h3 id=\"chapter-2-adjusting-to-the-new-normal\"><a class=\"anchor\" href=\"#chapter-2-adjusting-to-the-new-normal\">#</a> Chapter 2: <strong>Adjusting to the New Normal</strong></h3>\n<p>Days passed, and I settled into my new reality, though the confusion never left me. I couldn’t bring myself to talk to anyone about the change, not even my best friend, Natsuki. She was the one person who might have understood, but how could I possibly explain this? How could I tell her that I had once been a boy, and now I was...this?</p>\n<p>Natsuki was a vibrant, outgoing girl, the kind of person everyone gravitated toward. We had grown close in the past few months, ever since Ren left for America. She had helped me through the transition in ways she didn’t even realize. But even she had no idea about the deeper change, the one that had turned my world upside down.</p>\n<p>One afternoon, Natsuki and I sat together in the school courtyard, watching the boys play basketball. My heart twisted as I watched them run up and down the court, laughing and shouting, just like Ren and I used to.</p>\n<p>“Do you ever miss it?” Natsuki asked suddenly, turning to me.</p>\n<p>“Miss what?” I asked, though I knew exactly what she meant.</p>\n<p>“Playing basketball. You used to play all the time, right? Before...well, before everything changed.”</p>\n<p>I looked down at my hands, clenching and unclenching my fingers. “Yeah. I miss it.”</p>\n<p>“You should join the girls’ team,” she suggested, her eyes lighting up. “You’d be great.”</p>\n<p>I shook my head. “I don’t think I can. It’s...it’s different now.”</p>\n<p>Natsuki frowned, but didn’t push me further. She was good like that—knowing when to back off, when to let me process things on my own. We sat in silence for a while, the sound of basketballs bouncing on the pavement filling the air.</p>\n<p>That’s when the rumors started.</p>\n<p>Weeks later, the news spread like wildfire. Ren was coming back to Japan.</p>\n<p>The first time I heard the news, I thought it was a joke, just a rumor blown out of proportion by excited classmates. Ren, my best friend, returning to Japan after becoming a rising basketball star in the United States? It didn’t feel real. But as days went by, the rumor solidified into fact. Ren was coming back to attend high school here in Japan, and not just any school—<em>my</em> school.</p>\n<p>I wasn’t sure how to feel about it. A part of me, the part that still remembered all the late afternoons we spent on the basketball court, wanted to be thrilled. After all, Ren and I had been inseparable back in primary school. We had shared everything—our love for basketball, our dreams of playing professionally one day, and even our deepest thoughts and worries. But now, everything was different. Ren was still the same person, but I had changed completely. He would never recognize me as the person I had once been.</p>\n<p>As the news spread through school, it seemed like everyone was talking about it. People whispered about how Ren had made a name for himself overseas, about his skill on the court, and how lucky our school was to have him join the team. The excitement was palpable, especially among the girls. He had apparently grown into a good-looking guy, charming and confident—a celebrity in his own right.</p>\n<p>I tried to avoid the topic, but it was impossible. Natsuki, my best friend since the transformation, couldn’t stop talking about it.</p>\n<p>“Isn’t it exciting?” she said one afternoon, her eyes bright as we sat together in the cafeteria. “Ren will be at our school! Can you imagine? It’s like having a celebrity walk these halls!”</p>\n<p>I smiled weakly, stirring my soup. “Yeah, I guess.”</p>\n<p>Natsuki raised an eyebrow. “You don’t seem excited.”</p>\n<p>I shrugged, not trusting myself to say more. How could I explain that my feelings were a confusing tangle of excitement, fear, and sadness? I wasn’t ready to face Ren—not like this.</p>\n<p>“I just... I don’t really know him,” I lied. It was easier than telling her the truth. “I mean, we were in the same school before, but I don’t think we ever talked much.”</p>\n<p>She gave me a skeptical look but didn’t press further. Thankfully, Natsuki was one of those people who could sense when to back off, and I was grateful for that. She changed the subject quickly, telling me about her plans for the weekend with her new boyfriend. She had been pushing me lately to start dating too, insisting it was time for me to “move on” and embrace the new me.</p>\n<p>“You should find someone,” she said, leaning in conspiratorially. “I’ve noticed a few guys eyeing you. It’s time to have some fun, Yuki.”</p>\n<p>Yuki. That was my new name. A name that felt foreign in my mouth for the first few weeks after my transformation but had slowly become a part of me. After all, Yūto didn’t seem to fit anymore. I wasn’t that boy. I wasn’t Ren’s basketball buddy. I was Yuki now—a girl with a new life, a new identity.</p>\n<p>But despite Natsuki’s constant encouragement, I wasn’t interested in finding a boyfriend. Not because I didn’t want to, but because I was still wrestling with my own identity. How could I start a relationship with someone when I didn’t even know who I was anymore?</p>\n<hr />\n<h3 id=\"chapter-3-the-return\"><a class=\"anchor\" href=\"#chapter-3-the-return\">#</a> Chapter 3: <strong>The Return</strong></h3>\n<p>The day Ren returned was surreal. I didn’t expect to see him immediately, thinking he would quietly settle in before making any appearances, but it seemed like fate had other plans. That morning, I was walking to class with Natsuki, who was chatting away about something I couldn’t focus on, when I heard a familiar voice behind me.</p>\n<p>“Hey, excuse me, do you know where the basketball gym is?”</p>\n<p>I froze mid-step. That voice—I would’ve recognized it anywhere, even after all these years. Slowly, I turned around, my heart pounding in my chest.</p>\n<p>There he was. Ren.</p>\n<p>He looked...older, taller, broader. His hair was a little longer than I remembered, and his once-boyish face had sharpened into something more mature. But his eyes, the same playful, mischievous spark that had always been there, hadn’t changed. He stood in front of me, holding a basketball in his hands, looking like he had stepped right out of one of my memories.</p>\n<p>For a split second, I panicked. What if he recognized me? What if, somehow, he could see through all the changes and remember that I had been his best friend? But as his eyes met mine, there was no flicker of recognition. Nothing. To him, I was just another girl in the hall.</p>\n<p>Natsuki, of course, jumped at the chance to talk to him. She turned on her brightest smile, completely oblivious to the internal chaos happening inside me.</p>\n<p>“Yeah, I can show you!” she said, grabbing my arm. “We’re headed that way, actually.”</p>\n<p>Ren smiled, that same easy, confident smile I remembered. “Thanks. I’m Ren, by the way.”</p>\n<p>I swallowed, feeling my throat tighten as I forced myself to speak. “I’m Yuki. This is Natsuki.”</p>\n<p>His gaze flicked to me briefly, but again, there was no hint of recognition. “Nice to meet you, Yuki. So, are you both fans of basketball?”</p>\n<p>I forced a smile, though the words felt heavy in my throat. “I used to play a little.”</p>\n<p>Natsuki laughed. “Yuki’s just being modest. She’s a huge basketball fan, even if she doesn’t play anymore.”</p>\n<p>Ren chuckled, a sound that sent a pang of nostalgia through me. “You should come to our games then. I’m joining the team here.”</p>\n<p>I nodded, not trusting myself to say more. The rest of the conversation blurred as Natsuki and Ren chatted easily, but all I could think about was how strange it felt to be standing in front of him, knowing that he had no idea who I really was.</p>\n<hr />\n<h3 id=\"chapter-4-a-strange-familiarity\"><a class=\"anchor\" href=\"#chapter-4-a-strange-familiarity\">#</a> Chapter 4: <strong>A Strange Familiarity</strong></h3>\n<p>The days that followed felt like a balancing act. I tried to stay in the background, watching Ren from afar as he integrated himself into the school’s basketball team. It didn’t take long for him to become a local celebrity again, just as he had been in the States. Everyone wanted to be his friend. The girls giggled whenever he walked by, and the guys treated him like some kind of hero. It was surreal, seeing him so admired, so different from the boy I had known.</p>\n<p>Despite all the attention, Ren seemed to gravitate toward me and Natsuki. Maybe it was because we had been the first people he had spoken to when he returned, or maybe it was because we didn’t treat him like a star. Either way, we began spending more time together, and every day that passed made it harder for me to keep my secret.</p>\n<p>Sometimes, when we were alone, I could feel him watching me, as if he sensed something familiar about me that he couldn’t quite place. He’d ask me little questions—where I grew up, what I liked to do, if I had any siblings. I would answer carefully, keeping my responses vague, not wanting to give anything away. But there was one thing I couldn’t hide: my love for basketball.</p>\n<p>One afternoon, we were watching the team practice, and Ren turned to me, a teasing smile on his lips. “I don’t get it. If you love basketball so much, why don’t you play anymore?”</p>\n<p>I looked away, the question striking deeper than he knew. “It’s...complicated.”</p>\n<p>He raised an eyebrow, leaning back on the bleachers. “Complicated how?”</p>\n<p>I hesitated, feeling the weight of the truth sitting heavily on my chest. How could I explain it to him? How could I tell him that the boy he used to know, the one who had played basketball with him every day after school, didn’t exist anymore?</p>\n<p>“It just is,” I finally said, forcing a smile. “I’m not the same person I used to be.”</p>\n<p>Ren looked at me for a long moment, and for the briefest second, I thought I saw something flicker in his eyes—something like recognition. But then he smiled again, that same easy, carefree smile that always made me feel like everything was going to be okay.</p>\n<p>“Well, if you ever want to pick it up again, I’d be happy to teach you some moves,” he said, tossing the basketball in the air and catching it effortlessly.</p>\n<p>I smiled, but my heart ached. There was so much I wanted to tell him, but I knew I couldn’t. Not yet. Maybe not ever.</p>\n<hr />\n<h3 id=\"chapter-5-the-conflict-within\"><a class=\"anchor\" href=\"#chapter-5-the-conflict-within\">#</a> Chapter 5: <strong>The Conflict Within</strong></h3>\n<p>As the weeks passed, my feelings toward Ren became more complicated. I found myself drawn to him in ways I hadn’t expected. It wasn’t just the nostalgia of our shared past, but something deeper, something that made my heart race whenever he was near. I knew I was developing feelings for him, but it felt wrong. How could I fall for my best friend? How could I love someone who didn’t even know who I really was?</p>\n<p>To make matters worse, Natsuki noticed too.</p>\n<p>“You like him, don’t you?” she asked one day after school as we walked home together.</p>\n<p>I stopped in my tracks, startled by her question. “What? No, I—”</p>\n<p>“Don’t lie to me,” she said, grinning. “I can tell. You get all quiet and weird around him.”</p>\n<p>I blushed, looking away. “It’s not like that.</p>\n<p>Natsuki gave me a knowing look, her grin widening. “Yuki, you’re terrible at hiding it. Trust me, I’ve seen that look before.”</p>\n<p>I tried to laugh it off, waving my hand dismissively. “I don’t know what you’re talking about.”</p>\n<p>She just shook her head, clearly amused. “You don’t have to lie to me, you know. It’s totally normal to like someone like Ren. Half the girls at school are probably crushing on him right now.”</p>\n<p>The thought of that sent a pang of discomfort through me. It wasn’t just that other girls liked him. It was the fact that Ren didn’t know who I really was, and that was something no one else would ever understand. How could I let myself have feelings for someone who didn’t recognize me as the boy who had been his best friend?</p>\n<p>I remained silent, and Natsuki took that as confirmation. She nudged me playfully. “You should tell him! Maybe he feels the same way.”</p>\n<p>I froze at that. The idea of confessing my feelings to Ren was terrifying. “No way. It’s...complicated.”</p>\n<p>Natsuki raised an eyebrow, frowning. “You keep saying that. What’s so complicated about it?”</p>\n<p>I bit my lip, trying to come up with an answer that wouldn’t reveal too much. “It’s just...I don’t think he would see me that way. And besides, we’re just friends.”</p>\n<p>Natsuki gave me a skeptical look but didn’t press further. “Alright, if you say so. But don’t wait too long, Yuki. You never know what might happen.”</p>\n<p>Her words lingered in my mind long after we parted ways that afternoon. The truth was, I wasn’t just afraid of Ren rejecting me. I was afraid of what would happen if he ever found out the truth—that the girl he knew as Yuki had once been his best friend, Yūto. I didn’t want to lose him, not again. But how long could I keep pretending?</p>\n<hr />\n<h3 id=\"chapter-6-the-weight-of-secrets\"><a class=\"anchor\" href=\"#chapter-6-the-weight-of-secrets\">#</a> Chapter 6: <strong>The Weight of Secrets</strong></h3>\n<p>As the months went by, Ren and I grew closer, and so did the weight of the secret I was carrying. There were moments, fleeting and subtle, where I could see the flicker of familiarity in his eyes. Sometimes, when we were talking about something random, he would pause and look at me like he was trying to remember something just out of reach. But he never pressed further, and I never gave him a reason to.</p>\n<p>My days were filled with a strange mixture of joy and guilt. Joy, because I was spending time with Ren again, laughing, talking, and watching him play basketball. Guilt, because every time we were together, I was hiding the truth from him. And the more I hid, the more complicated my feelings became.</p>\n<p>One afternoon, after basketball practice, Ren and I were sitting on the bleachers. The gym was mostly empty, with just a few players shooting hoops on the other end of the court. He was spinning the ball in his hands, a contemplative look on his face.</p>\n<p>“You know,” he began, his voice quiet, “being back here feels weird sometimes.”</p>\n<p>I glanced at him, unsure where he was going with this. “Weird how?”</p>\n<p>He sighed, looking up at the ceiling. “I spent so many years in America. Everything was different there. The culture, the people...but the one thing that always felt familiar was basketball. It was the one thing that stayed the same, no matter where I was.”</p>\n<p>I nodded, understanding exactly what he meant. Basketball had been that constant for both of us, back when we were kids. It was the thing that had brought us together.</p>\n<p>Ren glanced at me then, his expression thoughtful. “I used to play with this friend of mine, back when I was younger. We were inseparable. We used to talk about how we’d go pro one day.”</p>\n<p>My heart skipped a beat. He was talking about me—about <em>Yūto</em>.</p>\n<p>“He was really good,” Ren continued, a small smile playing on his lips as he stared down at the basketball. “Better than me, actually. But one day, everything just...changed. He stopped playing. We lost touch after that.”</p>\n<p>I swallowed hard, feeling the weight of his words. Ren didn’t know that the friend he was talking about was sitting right next to him.</p>\n<p>“Do you ever wonder what happened to him?” I asked quietly, my voice barely above a whisper.</p>\n<p>Ren shrugged, his expression a little sad. “Sometimes. I always thought we’d reconnect one day, you know? But...I don’t even know where he is now.”</p>\n<p>My chest tightened with guilt. He was right here, and yet I couldn’t tell him.</p>\n<p>“I’m sure he’s doing okay,” I said, forcing a smile. “People change, you know? Maybe he’s just...living a different life now.”</p>\n<p>Ren nodded slowly, but I could tell he wasn’t entirely convinced. “Yeah, maybe.”</p>\n<p>We sat in silence for a while, the weight of unspoken truths hanging between us. It was in moments like these that I felt the most conflicted—torn between wanting to be honest with him and fearing what would happen if I was.</p>\n<hr />\n<h3 id=\"chapter-7-the-basketball-court\"><a class=\"anchor\" href=\"#chapter-7-the-basketball-court\">#</a> Chapter 7: <strong>The Basketball Court</strong></h3>\n<p>One evening, I found myself alone in the gym, long after everyone else had left. The basketball court was empty, the lights casting a soft glow over the polished floor. I stood at the free-throw line, a basketball in my hands, the familiar weight of it grounding me. It had been so long since I had actually <em>played</em>. I missed it, more than I was willing to admit.</p>\n<p>But standing there, I couldn’t help but feel the memories rush back—the times I had played here with Ren, the way we used to challenge each other to ridiculous shots, the way we used to dream about being the best.</p>\n<p>I dribbled the ball a few times, the sound echoing in the empty gym. I closed my eyes, imagining myself as that boy again, Yūto, before everything had changed. I took a deep breath and shot the ball. It swished through the hoop with a perfect, clean arc.</p>\n<p>It felt...good. Natural. Like a part of me that I had locked away was finally coming back to life.</p>\n<p>I retrieved the ball and shot again, this time from farther away. Another swish. A rush of adrenaline surged through me, and for the first time in what felt like forever, I let myself <em>play</em>. I ran up and down the court, shooting, dribbling, feeling the joy of the game wash over me. It was as if, for a few moments, I had stepped back in time, back to the days when I had been a carefree boy, playing with my best friend.</p>\n<p>But those moments didn’t last.</p>\n<p>Just as I was about to take another shot, I heard the door to the gym open. I froze, the ball still in my hands, and turned to see Ren standing in the doorway, watching me.</p>\n<p>For a split second, neither of us moved. My heart raced as I realized that he had seen me play.</p>\n<p>“Yuki?” Ren said, stepping into the gym, his voice filled with surprise. “I didn’t know you could play like that.”</p>\n<p>I swallowed hard, trying to keep my voice steady. “I...I used to play a long time ago.”</p>\n<p>He walked over to me, a grin spreading across his face. “You’re really good. Why’d you stop?”</p>\n<p>The question hit me harder than I expected. I looked down at the basketball in my hands, trying to find the right words. “I...I don’t know. Things just...changed.”</p>\n<p>Ren studied me for a moment, as if trying to piece something together. Then, without warning, he tossed me the ball. “Come on. Let’s play.”</p>\n<p>I hesitated, but there was something about the way he said it—so casual, so familiar—that made it impossible to refuse. I nodded slowly and passed the ball back to him.</p>\n<p>We spent the next half hour playing one-on-one, just like we used to. At first, it was awkward. I was nervous, afraid that he might somehow recognize me, but as the game went on, I found myself relaxing. It felt good to be on the court again, to move, to play. And for a little while, I forgot about everything else.</p>\n<p>By the time we finished, both of us were out of breath, laughing like we hadn’t in years. Ren wiped the sweat from his forehead, shaking his head in disbelief.</p>\n<p>“You’re something else, Yuki,” he said, still catching his breath. “You remind me of...someone.”</p>\n<p>My heart skipped a beat. “Someone?”</p>\n<p>He nodded, smiling faintly. “Yeah. My old friend. The one I told you about. You play just like him.”</p>\n<p>I forced a laugh, hoping it didn’t sound as strained as it felt. “Well, maybe I’m just lucky.”</p>\n<p>Ren looked at me for a long moment, and for the briefest second, I thought he was going to say something—something that would reveal that he knew, or at least suspected the truth. But then he just smiled and patted me on the shoulder.</p>\n<p>“You should play more often. You’re really good.”</p>\n<p>I nodded, but inside, I was torn. Every time we played together, every time we talked, the guilt gnawed at me. How long could I keep this up? How long could I keep pretending to be someone I wasn’t?</p>\n<hr />\n<h3 id=\"chapter-8-the-turning-point\"><a class=\"anchor\" href=\"#chapter-8-the-turning-point\">#</a> Chapter 8: <strong>The Turning Point</strong></h3>\n<p>It was a rainy afternoon when everything came crashing down.</p>\n<p>Ren and I were sitting under the awning outside the gym, waiting for the rain to stop. We had just finished another casual one-on-one game. The steady drumming of raindrops on the roof filled the silence between us, but it was a comfortable silence, one that had grown familiar over the past few weeks.</p>\n<p>I leaned back against the wall, hugging my knees to my chest, and glanced at Ren. He was staring out into the rain, twirling a basketball absentmindedly between his fingers, lost in thought. There was something different in the air that day—an unspoken tension, like we were both waiting for something to happen, but neither of us wanted to make the first move.</p>\n<p>Finally, Ren broke the silence.</p>\n<p>“You know,” he began quietly, his voice almost drowned out by the rain, “sometimes I feel like I’m missing something. Like there’s this huge part of my life that I’ve forgotten, or maybe just...left behind.”</p>\n<p>I felt a chill run down my spine, but I didn’t say anything, letting him continue.</p>\n<p>“Ever since I came back to Japan, I’ve been thinking a lot about the past. About the friends I had before I left, especially Yūto.” He paused, turning the ball over in his hands. “I don’t know why, but lately, it feels like I’ve been seeing him everywhere. Like there’s something about this place—this school, this court—that reminds me of him.”</p>\n<p>My chest tightened. My throat felt dry, and I forced myself to speak, my voice barely a whisper. “Do you miss him?”</p>\n<p>Ren nodded slowly. “Yeah, I do. We were so close, and then suddenly...he was just gone. I never got the chance to ask him why he stopped playing basketball. I never even said goodbye.”</p>\n<p>I swallowed hard, my heart aching at the raw emotion in his voice. I wanted so badly to tell him the truth, to lift the weight that had been pressing down on me for so long. But the fear—of how he would react, of how everything could change in an instant—kept me silent.</p>\n<p>Ren sighed, leaning back against the wall beside me. “You know, Yuki, sometimes you remind me of him. The way you play, the way you talk about things...it’s almost like I’m talking to him again.”</p>\n<p>My heart pounded in my chest, the guilt clawing at me. I couldn’t keep this up any longer. I couldn’t keep lying to him, pretending to be someone else when all I wanted was to tell him the truth.</p>\n<p>“Ren...” I started, my voice trembling, “there’s something I need to tell you.”</p>\n<p>He turned to look at me, his expression soft but curious. “What is it?”</p>\n<p>I opened my mouth to speak, but the words caught in my throat. I felt frozen, paralyzed by the enormity of what I was about to reveal. How could I explain something so impossible? How could I tell him that the person he was missing—the friend he had lost—was sitting right next to him?</p>\n<p>The rain poured down harder, as if the world itself was holding its breath, waiting for me to say what needed to be said.</p>\n<p>“I...” My hands were trembling. “Ren, I—”</p>\n<p>Before I could finish, the sound of footsteps approached. I quickly looked up to see Natsuki, holding an umbrella, hurrying toward us.</p>\n<p>“Hey! There you are!” she called, a bright smile on her face, completely oblivious to the weight of the moment she had interrupted. “I’ve been looking for you two. The rain’s supposed to clear up soon, but I thought I’d come rescue you.”</p>\n<p>Ren smiled at her, grateful for the distraction, but my heart sank. The moment was gone. The truth—my truth—stayed locked inside me for another day.</p>\n<hr />\n<h3 id=\"chapter-9-a-decision\"><a class=\"anchor\" href=\"#chapter-9-a-decision\">#</a> Chapter 9: <strong>A Decision</strong></h3>\n<p>The days after that conversation weighed heavily on me. Every time I saw Ren, every time we talked, the words I had been too afraid to say gnawed at my conscience. I knew I couldn’t keep pretending forever. Eventually, the truth would come out—whether I wanted it to or not.</p>\n<p>But the closer I got to Ren, the more complicated my feelings became. It wasn’t just about our past friendship anymore. Over the months, my feelings for him had deepened into something I hadn’t expected. I didn’t just miss him as a friend—I was falling for him, and that terrified me.</p>\n<p>How could I fall for someone who didn’t even know who I really was? And even if he did know, how could I expect him to accept the truth? What if telling him ruined everything? What if he hated me for keeping such a huge secret?</p>\n<p>The questions kept me awake at night, and as much as I tried to push them aside, they lingered in the back of my mind every time we were together.</p>\n<p>It was Natsuki who finally pushed me toward a decision, though she had no idea what was really going on.</p>\n<p>We were sitting in her room one evening, flipping through magazines and talking about school. She had been dating her boyfriend, Takeru, for a few months now, and she was practically glowing with happiness. I envied her, not because of her relationship, but because of how uncomplicated her feelings were. She didn’t have to worry about secrets or hidden identities. She could just be herself, and that was enough.</p>\n<p>“You know,” Natsuki said, setting down her magazine and turning to me, “you should really just tell Ren how you feel.”</p>\n<p>I blinked, startled. “What?”</p>\n<p>She smiled. “Come on, Yuki. It’s obvious you like him. And it’s pretty clear he likes you too.”</p>\n<p>I felt a flush of heat rise to my cheeks. “I-I don’t think it’s that simple.”</p>\n<p>Natsuki raised an eyebrow. “Why not? You two have been hanging out so much lately, and I’ve seen the way he looks at you. Trust me, he’s into you. You just need to make the first move.”</p>\n<p>I stared at her, my mind racing. If only it were that simple. But the truth was, my feelings for Ren were tangled up in so much more than just a simple crush. They were tied to my past, to the person I used to be—and the person I had become.</p>\n<p>Natsuki must have sensed my hesitation because her expression softened. “Hey, what’s wrong? You’ve been kind of off lately. Is something bothering you?”</p>\n<p>I looked down at my hands, struggling to find the right words. I wanted to tell her everything, but how could I explain something so strange, so unbelievable? Even Natsuki, with all her understanding, might find it hard to accept the truth.</p>\n<p>“It’s just...complicated,” I said quietly.</p>\n<p>Natsuki sighed, but she didn’t push further. “Well, whatever it is, you know you can talk to me, right? And seriously, don’t wait too long with Ren. If you like him, go for it. Life’s too short to wait around.”</p>\n<p>Her words stuck with me long after I left her house that night. Life was too short to keep hiding. I knew I had to make a decision soon—either tell Ren the truth or walk away from him before things got even more complicated.</p>\n<p>But the thought of walking away hurt more than I was willing to admit. I couldn’t lose Ren again, not after everything we had been through, even if he didn’t know the full story.</p>\n<hr />\n<h3 id=\"chapter-10-the-truth\"><a class=\"anchor\" href=\"#chapter-10-the-truth\">#</a> Chapter 10: <strong>The Truth</strong></h3>\n<p>The next time I saw Ren, I knew what I had to do.</p>\n<p>We were in the gym again, late in the afternoon after practice. The court was empty except for the two of us. Ren was shooting baskets, his focus sharp as ever, but I could tell he was distracted. His shots were a little off, and he kept glancing at me like he had something on his mind.</p>\n<p>Finally, after missing another shot, he turned to me with a frown. “Yuki, is everything okay? You’ve been acting...different lately.”</p>\n<p>I hesitated, my heart pounding in my chest. This was it. There was no turning back now.</p>\n<p>“Ren,” I said, my voice trembling, “there’s something I need to tell you. Something I should’ve told you a long time ago.”</p>\n<p>He looked at me, concern flickering in his eyes. “What is it?”</p>\n<p>I took a deep breath, feeling my hands shake as I tried to find the words. “I...I haven’t been completely honest with you.”</p>\n<p>Ren’s frown deepened, and he stepped closer, his eyes searching mine. “What do you mean?”</p>\n<p>I swallowed hard, forcing myself to meet his gaze. “You remember your friend, Yūto? The one you used to play basketball with?”</p>\n<p>His expression softened slightly, and he nodded. “Of course. I’ve told you about him.”</p>\n<p>I nodded, feeling my throat tighten. “Ren...I’m Yūto.”</p>\n<p>The silence that followed was deafening. Ren just stared at me, his expression frozen in confusion and disbelief.</p>\n<p>“What?” he finally said, his voice barely audible.</p>\n<p>“I was Yūto,” I repeated, my voice shaking. “I don’t know how to explain it, but...I changed. One day, I woke up, and I was different. Physically. Everything changed. I became...Yuki.”</p>\n<p>Ren’s eyes widened, and he took a step back, shaking his head. “That’s...impossible. You’re joking, right?”</p>\n<p>I shook my head, tears welling up in my eyes. “I’m not joking, Ren. I know it sounds crazy, but it’s the truth. I woke up one day, and I wasn’t the same anymore,” I said, my voice trembling with the weight of the confession. “I didn’t know how to tell you. I didn’t know how to tell anyone.”</p>\n<p>Ren’s face was a mixture of confusion, disbelief, and something else—something like hurt. He ran a hand through his hair, pacing a few steps away from me. The gym, once a place filled with our shared memories, now felt like a cage, trapping us both in this moment.</p>\n<p>“You’re telling me...you’re Yūto? The Yūto I grew up with? My best friend?” His voice was strained, like he couldn’t quite wrap his mind around what I was saying.</p>\n<p>I nodded, tears stinging the corners of my eyes. “Yes. I’ve been Yūto all along, but after the transformation, I didn’t know how to explain it to anyone. It was like waking up in someone else’s body. I was scared. I still am.”</p>\n<p>Ren stood there, motionless, staring at me as if seeing me for the first time. The silence between us stretched on, each second agonizing. I wanted to explain everything, to tell him how much I had missed him, how hard it had been to pretend I was someone else. But I didn’t know where to begin, and I could see the gears turning in his head as he tried to process it all.</p>\n<p>Finally, Ren spoke, his voice soft and almost broken. “Why didn’t you tell me sooner?”</p>\n<p>The question hit me hard, like a punch to the gut. It wasn’t accusatory, but the pain in his voice was undeniable. I wiped my eyes, struggling to hold myself together. “I didn’t know how,” I admitted, my voice shaking. “I was afraid. I didn’t want to lose you. And once we started getting closer again...it just became harder to tell you.”</p>\n<p>Ren’s jaw clenched, and he turned away from me, staring down at the basketball in his hands. “So, all this time...every time we played, every time we talked...you were pretending? You were hiding this from me?”</p>\n<p>“No!” I said quickly, taking a step toward him. “I wasn’t pretending. Everything between us has been real. I just...I didn’t want you to hate me.”</p>\n<p>Ren didn’t respond for a long time. He stood there, gripping the ball tightly, his shoulders tense. I could see the conflict on his face—the disbelief, the confusion, the hurt. Finally, he let out a long breath and turned back to me.</p>\n<p>“I don’t hate you,” he said quietly, though his voice was strained. “But I don’t understand. How could this even happen? How could you just...change like that?”</p>\n<p>I shook my head, feeling a fresh wave of frustration. “I don’t know. I’ve spent so much time trying to figure it out myself, but there’s no explanation. One day, I was Yūto, and the next, I woke up as Yuki. It’s like the whole world moved on as if nothing had changed, but for me, everything was different.”</p>\n<p>Ren stared at me for a long moment, his brow furrowed as he tried to process it all. I could see the questions swirling in his mind, the disbelief that still lingered. He rubbed the back of his neck, his expression conflicted.</p>\n<p>“So, you’re saying...you’ve been living as Yuki this whole time, but inside, you’re still Yūto?” he asked, his voice cautious.</p>\n<p>I hesitated, unsure of how to answer. “It’s not that simple,” I said finally. “I’m still me. But I’ve had to become Yuki, too. I’ve had to learn how to live as her, to fit into this new world. I didn’t stop being Yūto, but I couldn’t go back to him either.”</p>\n<p>Ren exhaled sharply, running a hand through his hair again. “This is...a lot.”</p>\n<p>“I know,” I whispered, feeling the weight of my secret pressing down on me again. “I never wanted to lie to you, Ren. I just didn’t know how to make you understand.”</p>\n<p>He was silent for a long time, his eyes distant as if he was lost in thought. Then, finally, he met my gaze, his expression unreadable. “I need some time to think about this.”</p>\n<p>His words stung, but I knew he was right. This was too much to expect him to understand all at once. I nodded, my heart aching. “I get it. Take all the time you need.”</p>\n<p>Ren didn’t say anything else. He just turned and walked out of the gym, leaving me standing there alone, the sound of the rain outside mingling with the hollow emptiness I felt inside.</p>\n<hr />\n<h3 id=\"chapter-11-aftermath\"><a class=\"anchor\" href=\"#chapter-11-aftermath\">#</a> Chapter 11: <strong>Aftermath</strong></h3>\n<p>The days after my confession were some of the hardest I’d ever experienced. Ren hadn’t spoken to me since that afternoon in the gym, and the space between us felt like an unbridgeable chasm. I saw him around school, but he kept his distance, avoiding eye contact and pretending I wasn’t there.</p>\n<p>It hurt more than I’d expected it to. I had thought that telling Ren the truth would be a relief, that we could somehow move past it and rebuild our friendship. But the reality was far more complicated. Ren needed time—time to process, time to figure out how he felt about everything. And as much as it pained me, I had to give him that space.</p>\n<p>Natsuki noticed the change in me immediately. She cornered me one day after class, her eyes full of concern.</p>\n<p>“Yuki, what’s going on? You and Ren haven’t been hanging out lately. Did something happen?”</p>\n<p>I hesitated, unsure of how much to tell her. She was my best friend, but I wasn’t ready to explain everything. “It’s...complicated,” I said, for what felt like the hundredth time.</p>\n<p>Natsuki crossed her arms, frowning. “You keep saying that. Complicated how?”</p>\n<p>I sighed, feeling the weight of the secret pressing down on me again. “We had a conversation...about something from the past. And now things are just...weird between us.”</p>\n<p>Natsuki gave me a sympathetic look, but she didn’t push further. “Well, whatever it is, I hope you two can work it out. You’ve been through too much together to let this come between you.”</p>\n<p>Her words echoed in my mind for the rest of the day. She was right—we had been through too much. But would Ren ever be able to accept what I had told him? Could he forgive me for keeping such a huge secret?</p>\n<hr />\n<h3 id=\"chapter-12-rens-decision\"><a class=\"anchor\" href=\"#chapter-12-rens-decision\">#</a> Chapter 12: <strong>Ren’s Decision</strong></h3>\n<p>A week passed before Ren finally approached me again.</p>\n<p>I was sitting alone on the bleachers after school, watching the basketball team practice. Ren hadn’t been at practice that day, which had only added to the tension I felt. I didn’t know what was going through his mind, whether he was angry, hurt, or just confused. But I missed him. I missed our easy conversations, our shared laughter, and the way we used to play basketball together like we were the only two people in the world.</p>\n<p>I heard footsteps behind me and turned to see Ren walking toward me. My heart raced, and I stood up, unsure of what to expect.</p>\n<p>“Can we talk?” he asked, his voice calm but serious.</p>\n<p>I nodded, my throat tight with anxiety. “Yeah.”</p>\n<p>We sat down on the bleachers, side by side, and for a long moment, neither of us spoke. I could feel the tension in the air, the unspoken words hanging between us. Finally, Ren broke the silence.</p>\n<p>“I’ve been thinking a lot about what you told me,” he said quietly, his eyes focused on the court in front of us. “And I still don’t fully understand it. I don’t know if I ever will.”</p>\n<p>I bit my lip, bracing myself for whatever he was going to say next.</p>\n<p>“But,” he continued, turning to look at me, “you’re still the same person I’ve been friends with all this time. Whether you’re Yūto or Yuki, you’re still...<em>you</em>. And that’s what matters.”</p>\n<p>I felt a rush of relief, my chest tightening with emotion. “Ren, I—”</p>\n<p>He held up a hand, stopping me. “I’m not going to lie. It’s been hard for me to wrap my head around everything. And I’m not sure what this means for us, or how we’re supposed to move forward. But I don’t want to lose you as a friend. Not again.”</p>\n<p>Tears welled up in my eyes, and I nodded, unable to find the right words. “I don’t want to lose you either.”</p>\n<p>Ren gave me a small, tentative smile, and for the first time since our conversation in the gym, I felt a glimmer of hope. It wasn’t going to be easy, but maybe, just maybe, we could rebuild what we had lost.</p>\n<p>“I’m not saying I’m okay with everything yet,” Ren said, his expression serious. “But I’m willing to try. To figure it out. Together.”</p>\n<p>I wiped my eyes, feeling a mix of relief and gratitude. “Thank you. I know this isn’t easy for you.”</p>\n<p>He shrugged, a hint of his old playful smile returning. “Life’s never easy, right? But we’ll get through it. We always do.”</p>\n<p>I smiled back, my heart lighter than it had been in weeks. For the first time in what felt like forever, I felt like things might actually be okay. We weren’t back to where we used to be—those carefree days of our childhood—but we were on a path to something new, something that would allow us to rediscover our friendship in a different way. It wouldn’t be easy, but Ren’s willingness to try, to figure things out together, made all the difference.</p>\n<p>The rest of that day felt lighter, like a burden I’d been carrying for months had finally started to lift. After our conversation, Ren and I sat in silence for a while, watching the basketball team practice. It was a comforting kind of quiet, and for the first time in a long while, I felt like we were both okay with not having all the answers. There was a lot we still needed to talk about, but for now, just sitting there with Ren was enough.</p>\n<hr />\n<h3 id=\"chapter-13-relearning-friendship\"><a class=\"anchor\" href=\"#chapter-13-relearning-friendship\">#</a> Chapter 13: <strong>Relearning Friendship</strong></h3>\n<p>In the days that followed, Ren and I found our rhythm again, but it was different this time—tentative, like we were both feeling our way through unfamiliar territory. I could tell he was still processing everything, and honestly, so was I. It was hard to explain the complexities of my identity even to myself, let alone to someone else, but Ren’s patience gave me hope.</p>\n<p>One afternoon after school, Ren and I met on the basketball court like we had so many times before. The air was crisp, the autumn breeze making the leaves dance on the edges of the court. Ren bounced the ball between his hands, his eyes flickering to me every so often, like he was trying to read me.</p>\n<p>“Wanna play a round?” he asked, his tone lighter than it had been in days.</p>\n<p>I smiled, feeling a bit of the old nostalgia return. “Sure. Let’s see if you can still beat me.”</p>\n<p>Ren laughed, the sound easy and familiar, and for the first time in a while, it felt like we were just two friends again—no secrets, no awkwardness. As we started playing, the rhythm of the game washed over us, and for those few moments, everything felt normal. We ran up and down the court, laughing, teasing each other, just like we had when we were kids.</p>\n<p>But there was something else in the air too—something that hadn’t been there before. A subtle tension, the knowledge that things had changed, and that we were both aware of it, even if we didn’t talk about it.</p>\n<p>After a few rounds, we sat down on the bench, both of us catching our breath. Ren glanced at me, his expression thoughtful. “You’ve gotten even better since the last time we played.”</p>\n<p>I smiled, wiping the sweat from my forehead. “I’ve had some time to practice.”</p>\n<p>He nodded, but then his gaze softened. “You know, Yuki...or Yūto—whoever you want to be—I don’t care. You’re still the same person I’ve always been friends with. But I think I need to ask you something.”</p>\n<p>My heart skipped a beat. “What is it?”</p>\n<p>Ren hesitated, looking down at the basketball in his hands. “Why didn’t you tell me earlier? I mean, I get that it’s hard, but...why didn’t you trust me with this sooner?”</p>\n<p>The question wasn’t accusatory, but I could hear the hurt behind it. I took a deep breath, trying to find the right words.</p>\n<p>“I was scared,” I admitted quietly. “I didn’t know how you would react. I thought you might hate me for not telling you right away, or that you wouldn’t be able to understand. And...I didn’t want to lose you.”</p>\n<p>Ren was silent for a moment, then he sighed and nodded. “I get that. I really do. But I wish you’d trusted me sooner. I would’ve been there for you, no matter what.”</p>\n<p>His words hit me hard, and I realized just how much I had underestimated Ren. He wasn’t the type of person to run away from difficult situations, and I should have known that. “I know,” I said, my voice shaky. “I’m sorry. I just...I didn’t know how.”</p>\n<p>Ren looked at me, his eyes filled with a mixture of understanding and something deeper—something that felt like forgiveness. “It’s okay. We’re here now, right?”</p>\n<p>I nodded, feeling a surge of gratitude. “Yeah. We are.”</p>\n<hr />\n<h3 id=\"chapter-14-a-new-beginning\"><a class=\"anchor\" href=\"#chapter-14-a-new-beginning\">#</a> Chapter 14: <strong>A New Beginning</strong></h3>\n<p>As the months passed, things between Ren and I slowly began to return to something resembling normalcy. But it wasn’t the same normal we had known before. It was a new kind of normal—one where our friendship had been reshaped by the truth I had finally revealed. There were still moments of awkwardness, times when Ren would glance at me and I could see the wheels turning in his mind, trying to reconcile the person I used to be with the person I was now. But for the most part, we found a way to move forward.</p>\n<p>We talked more openly now, about everything—about the past, about my transformation, and about how it had affected me. Ren was surprisingly understanding, even though I knew he didn’t fully grasp all the complexities of what I had gone through. But the fact that he was willing to listen, to try to understand, was enough for me.</p>\n<p>One afternoon, we were sitting outside after school, watching the sun dip below the horizon, casting a warm glow over the school grounds. Ren had just finished basketball practice, and I had waited for him like I used to when we were kids.</p>\n<p>He turned to me, a thoughtful expression on his face. “You know, I’ve been thinking a lot about what you said. About how you felt like the world moved on without you.”</p>\n<p>I looked at him, surprised. “Yeah?”</p>\n<p>He nodded, fidgeting with the straps of his bag. “I think...I get it. I mean, not exactly, but I can kind of understand what it must’ve been like. It’s like...everything changed for you, but for everyone else, it was just another day. That’s gotta be hard.”</p>\n<p>I felt a lump rise in my throat, his words hitting closer to home than I’d expected. “It was hard. But it’s been easier now, since I told you. Even though I was afraid, I feel like I can finally be myself again.”</p>\n<p>Ren smiled, a soft, genuine smile. “I’m glad you did. I missed you, you know? The real you.”</p>\n<p>I blinked, taken aback by his words. It wasn’t often that Ren got so serious, and hearing him say that he missed the “real” me filled me with a warmth I hadn’t felt in a long time.</p>\n<p>“I missed you too,” I said, my voice barely a whisper.</p>\n<p>He chuckled, leaning back against the bench. “We’ve got a lot to catch up on, don’t we?”</p>\n<p>I nodded, smiling. “Yeah. We do.”</p>\n<hr />\n<h3 id=\"chapter-15-looking-forward\"><a class=\"anchor\" href=\"#chapter-15-looking-forward\">#</a> Chapter 15: <strong>Looking Forward</strong></h3>\n<p>Life after that was far from perfect, but it was better. Ren and I rebuilt our friendship, piece by piece, learning to navigate the complexities of the past and the uncertainties of the future. There were still difficult moments, times when I wondered if things would ever truly go back to the way they were before. But I realized that maybe they didn’t need to. Maybe the way forward wasn’t about reclaiming the past, but about creating something new.</p>\n<p>Natsuki remained my constant source of support, always there when I needed someone to talk to. She never pressed for details about what had happened between Ren and me, but I could tell she was happy that we had worked things out. She even started joking about how Ren and I should just admit we had feelings for each other, though I always brushed it off with a laugh. Deep down, I wasn’t sure if I was ready to face that reality yet. My feelings for Ren were still complicated, tangled up in everything we’d been through, and I wasn’t sure if I was ready to open that door.</p>\n<p>But for now, I was content with where we were—two friends, finding our way through the uncertainty, and trusting each other more with each passing day.</p>\n<hr />\n<h3 id=\"epilogue-the-future-unfolds\"><a class=\"anchor\" href=\"#epilogue-the-future-unfolds\">#</a> Epilogue: <strong>The Future Unfolds</strong></h3>\n<p>Years later, as I look back on those days, I realize that the transformation I went through was more than just physical. It changed me in ways I couldn’t have imagined—forced me to confront parts of myself I didn’t even know existed. But through it all, I found strength. I found understanding. And most importantly, I found a way to be true to who I was, no matter what form that took.</p>\n<p>Ren and I remained close, our friendship evolving in ways that surprised both of us. We never quite returned to the days of being those two kids on the basketball court, dreaming about the future. But we built something better—something real, based on trust and acceptance. We learned to see each other for who we really were, not just who we had been.</p>\n<p>And as for my identity, I learned that it wasn’t about choosing between Yūto and Yuki. It was about accepting both, about understanding that I didn’t have to fit into one box or the other. I could be both, or neither, or something in between. And that was okay.</p>\n<p>Life continued to move forward, full of new challenges and new joys. But through it all, I knew one thing for certain—I wasn’t alone. I had my friends, my family, and the knowledge that, no matter what, I had the strength to face whatever came next.</p>\n<p>And as the years passed, I found peace in knowing that who I was—<em>who I am</em>—was enough.</p>\n",
            "tags": [
                "Novel",
                "life"
            ]
        },
        {
            "id": "http://example.com/2024/10/23/in-the-quiet-moments/",
            "url": "http://example.com/2024/10/23/in-the-quiet-moments/",
            "title": "In the Quiet Moments",
            "date_published": "2024-10-23T17:49:59.000Z",
            "content_html": "<blockquote>\n<p><em>In the rush of it all, sometimes stillness is the answer.</em></p>\n</blockquote>\n<p>There’s a strange peace in the early morning, before the world wakes up. The air feels different, like it’s not in a rush yet, like it’s just waiting to see what will happen. You stand there, maybe with a cup of coffee in your hand, and for a second, everything’s still.</p>\n<p>It’s funny how much we miss in our daily race from one thing to the next. We fill every gap with noise—calls, notifications, thoughts about what’s coming next. But in those rare pauses, when the day hasn’t decided to begin and you haven’t decided what you’re chasing yet, there’s a softness to life that’s easy to overlook.</p>\n<hr />\n<h2 id=\"the-space-between-thoughts\"><a class=\"anchor\" href=\"#the-space-between-thoughts\">#</a> <strong>The Space Between Thoughts</strong></h2>\n<p>Most people think the important stuff happens when you’re actively doing something—solving a problem, making a decision, getting things done. But the truth is, some of the best things come to you when you’re <em>not trying so hard</em>.</p>\n<h3 id=\"think-about-it\"><a class=\"anchor\" href=\"#think-about-it\">#</a> <strong>Think About It</strong>:</h3>\n<ul>\n<li>Great ideas rarely come when you’re staring at a blank page.</li>\n<li>Solutions appear when you’re walking, showering, or just <strong>sitting</strong> with nothing pressing.</li>\n<li>Sometimes, the more you force something, the more it slips away.</li>\n</ul>\n<p>It’s like trying to remember a name you’ve forgotten. The more you push, the more it fades. But let it go, let it drift somewhere in the background, and then—<strong>boom</strong>—there it is, <strong>easy as breathing</strong>.</p>\n<hr />\n<h3 id=\"how-it-unfolds-naturally\"><a class=\"anchor\" href=\"#how-it-unfolds-naturally\">#</a> <strong>How It Unfolds Naturally</strong>:</h3>\n<p>We’ve all been told that life rewards the hustlers. The ones who grind until they’ve made it. And sure, there’s value in effort. But there’s also value in:</p>\n<ul>\n<li>Patience</li>\n<li>Stillness</li>\n<li>Trusting the process</li>\n</ul>\n<p>It’s not about being passive. It’s about understanding that some things <em>can’t be forced</em>. Like how flowers bloom in their own time or how clouds drift without needing direction.</p>\n<p>Here’s something to think about:</p>\n<table>\n<thead>\n<tr>\n<th>Effort</th>\n<th>Patience</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Pushing hard, always chasing</td>\n<td>Letting things reveal themselves in their time</td>\n</tr>\n<tr>\n<td>Stressful, relentless</td>\n<td>Calm, trusting, observant</td>\n</tr>\n<tr>\n<td>Often missing details</td>\n<td>Seeing the whole picture</td>\n</tr>\n</tbody>\n</table>\n<hr />\n<h3 id=\"when-you-let-go\"><a class=\"anchor\" href=\"#when-you-let-go\">#</a> <strong>When You Let Go</strong>:</h3>\n<p>When you stop trying to control every outcome, you realize life might be leading you somewhere better than you planned. It’s like a river: you can’t force it to move faster, but if you let go, you’ll eventually find yourself where you need to be.</p>\n<p>Here’s a quick reminder:</p>\n<blockquote>\n<p><em>Don’t rush the river; it’ll carry you just fine.</em></p>\n</blockquote>\n<hr />\n<h3 id=\"finding-meaning-in-the-pause\"><a class=\"anchor\" href=\"#finding-meaning-in-the-pause\">#</a> <strong>Finding Meaning in the Pause</strong></h3>\n<p>Some of the most meaningful moments in life aren’t the ones we plan or chase—they’re the ones that just happen. They’re found:</p>\n<ul>\n<li>In a quiet laugh with a friend</li>\n<li>Sitting on a park bench, doing nothing in particular</li>\n<li>At the end of a long day when there’s nothing left to do</li>\n</ul>\n<p>We fill these spaces with distractions because we’re afraid that if we’re not constantly moving, we’re falling behind. But maybe... those spaces are where the <em>real stuff</em> of life happens. Maybe that’s where you find what you didn’t even know you were looking for.</p>\n<hr />\n<h2 id=\"the-path-less-rushed\"><a class=\"anchor\" href=\"#the-path-less-rushed\">#</a> <strong>The Path Less Rushed</strong></h2>\n<p>There’s a road you might not see when you’re moving too fast, but if you slow down—just a little—you’ll notice it. It’s not the road everyone takes because it requires:</p>\n<ol>\n<li>Patience</li>\n<li>Trust in timing</li>\n<li>A bit of faith that everything doesn’t need to happen all at once</li>\n</ol>\n<p>But once you’re on that path, you’ll start to realize it’s not about reaching the end quickly. It’s about the walk itself—<strong>the slow, steady pace</strong> that lets you take in everything around you.</p>\n<p>Here’s a little visual to remember that:</p>\n<figure class=\"highlight yaml\"><figcaption data-lang=\"YAML\"></figcaption><table><tr><td data-num=\"1\"></td><td><pre><span class=\"token key atrule\">patience</span><span class=\"token punctuation\">:</span></pre></td></tr><tr><td data-num=\"2\"></td><td><pre>  <span class=\"token punctuation\">-</span> breath</pre></td></tr><tr><td data-num=\"3\"></td><td><pre>  <span class=\"token punctuation\">-</span> trust</pre></td></tr><tr><td data-num=\"4\"></td><td><pre>  <span class=\"token punctuation\">-</span> observe</pre></td></tr></table></figure><hr />\n<h3 id=\"enough-as-it-is\"><a class=\"anchor\" href=\"#enough-as-it-is\">#</a> <strong>Enough as It Is</strong></h3>\n<p>At the end of the day, life isn’t a race. There’s no finish line, no trophy for crossing first. The moments that matter aren’t the ones you rush through. They’re the ones you <strong>allow</strong> to linger, the ones you give space to.</p>\n<p>Take a second to look around. Notice where you are, not just where you’re headed. Let yourself be in that moment.</p>\n<hr />\n<h2 id=\"final-words\"><a class=\"anchor\" href=\"#final-words\">#</a> <strong>Final Words</strong>:</h2>\n<blockquote>\n<p><em>Sometimes, you don’t need to go faster. You just need to be here.</em></p>\n</blockquote>\n",
            "tags": [
                "Thoughts",
                "Personal",
                "life",
                "moments"
            ]
        }
    ]
}